# Общие ограничения

http://HiredInTech.com - Copyright © 2014 HiredInTech

[Source](https://www.hiredintech.com/the-common-constraints-handout.pdf)

## Строки, массивы и числа

- Сколько элементов может быть в массиве?
- Насколько большим может быть каждый элемент? Если это строка, насколько большой? Если это число, то какое минимальное и максимальное значение?
- Что в каждом элементе? Если это число, это целое число или плавающая точка? Если это
строка, однобайтовая или многобайтовая (юникод)?
- Если проблема включает в себя поиск подпоследовательности, означает ли «подпоследовательность», что
элементы должны быть смежными или нет такого требования?
- Содержит ли массив уникальные числа или их можно повторить (это иногда
релевантно)?

## Сетки/лабиринты

- Для проблем, когда какой-либо актер (например, робот) движется в сетке или лабиринте, какие перемещения разрешены? Может ли робот перемещаться по диагонали (следовательно, 8 действительных ходов) или только по горизонтали/вертикали (следовательно, только 4 действительных хода)?
- Разрешены ли все ячейки в сетке или могут быть препятствия?
- Если актер пытается попасть из ячейки A в ячейку B, гарантированно ли ячейки A и B отличаются друг от друга?
- Если актер пытается попасть из ячейки A в ячейку B, гарантировано ли наличие пути между этими двумя ячейками?

## Графы

- Сколько узлов может иметь граф?
- Сколько рёбер может иметь граф?
- Если края имеют вес, каков диапазон для веса?
- Могут ли в графике быть петли? Могут ли в графе быть контуры отрицательной суммы?
- Направлен ли график или не направлен?
- Имеет ли граф несколько рёбер и/или самокольцов?

## Возвращаемые значения

- Что должен вернуть мой метод? Например, если я пытаюсь найти самую длинную подпоследовательность возрастающих чисел в массиве, следует ли возвращать длину, начальный индекс или и то и другое?
- Если есть несколько решений проблемы, какой из них должен быть возвращен?
- Если он должен возвращать несколько значений, вы предпочитаете, что возвращать? Например, должен ли он возвращать объект, кортеж, массив или передавать выходные параметры в качестве входных ссылок? (Это может быть неприменимо в языках, позволяющих возвращать несколько значений, например, Python)
- Что делать/возвращать, если входные данные неверны/не соответствуют ограничениям? Опции могут состоять в том, чтобы ничего не делать (всегда предполагать, что ввод правильный), создавать исключение или возвращать определенное значение.
- Что должно быть возвращено, если элемент отсутствует, в тех случаях, когда предполагается найти что-либо (например, число в массиве)?
